load-testing/csv-based-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 30
      arrivalRate: 2
      name: "CSV-based test"
  
  payload:
    path: "./test-data.csv"
    fields:
      - "email"
      - "password"
      - "name"
      - "department"

scenarios:
  - name: "CSV Login Test"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          expect:
            - statusCode: [200, 401]  # Accept both success and "user not found"